#Working with Northwind Dataset
//starting gremlin
	bin/gremlin.sh bin/northwind.groovy 

//loading northwind dataset
	graph = NorthwindFactory.createGraph()

//Creating/Initialising a traversal
	g = graph.traversal()

//Sample query to test whether things loaded as expected
	g.V().hasLabel("category").valueMap() // select and display all categories
//Output of sample gremlin query
	==>[name:[Beverages],description:[Soft drinks, coffees, teas, beers, and ales]]
	==>[name:[Condiments],description:[Sweet and savory sauces, relishes, spreads, and seasonings]]
	==>[name:[Confections],description:[Desserts, candies, and sweet breads]]
	==>[name:[Dairy Products],description:[Cheeses]]
	==>[name:[Grains/Cereals],description:[Breads, crackers, pasta, and cereal]]
	==>[name:[Meat/Poultry],description:[Prepared meats]]
	==>[name:[Produce],description:[Dried fruit and bean curd]]
	==>[name:[Seafood],description:[Seaweed and fish]]
// for further reading refer to: http://sql2gremlin.com/
